package define

// U开头的是常量（unchanged之意)
const (
	H1   = 100        // 100
	K1   = 1024       // 1024
	K8   = 8192       // 8k
	K64  = 65536      // 64k
	K256 = 262144     // 256k
	M1   = 1048576    // 1M
	M10  = 10485760   // 10M
	M100 = 104857600  // 100M
	G1   = 1073741824 //1G

	UMINSECS   = 60                  // 一分钟的秒数
	UMIN5SECS  = 60 * 5              // 5分钟的秒数
	UMIN15SECS = 60 * 15             // 15分钟的描述
	UDAYSECS   = 86400               // 一天的秒数
	UBIGSECS   = (86400 * 365 * 100) // 100年的秒数
)
